Volatility Framework là một tập hợp hoàn toàn mã nguồn mở các công cụ được triển khai bằng Python và được cấp phép theo GNU General Public License 2. Người phân tích sử dụng Volatility để trích xuất các tư liệu số từ các mẫu bộ nhớ tức thời (RAM). Vì Volatility là mã nguồn mở và miễn phí sử dụng, bạn có thể tải xuống và bắt đầu thực hiện phân tích nâng cao mà không phải trả bất kỳ chi phí nào. Hơn nữa, khi bạn muốn hiểu cách công cụ của mình hoạt động dưới nền, không có gì ngăn cản bạn khám phá và học hỏi trong khả năng tối đa.

Chương này cung cấp thông tin cơ bản để cài đặt Volatility, cấu hình môi trường và làm việc với các plugin phân tích. Nó cũng giới thiệu lợi ích của việc sử dụng Volatility và mô tả một số thành phần nội bộ giúp công cụ trở thành một thư viện đúng nghĩa. Hãy nhớ rằng phần mềm thay đổi theo thời gian. Do đó, khả năng, plugin, các yếu tố cài đặt và những yếu tố khác của framework có thể thay đổi trong tương lai.

## Why Volatiltiy?

Trước khi bạn bắt đầu sử dụng Volatility, bạn nên hiểu một số tính năng đặc biệt của nó. Như đã đề cập trước đó, Volatility không phải là ứng dụng pháp y trí nhớ duy nhất - nó được thiết kế để khác biệt. Dưới đây là một số lý do vì sao nhanh chóng trở thành công cụ lựa chọn của chúng tôi:


- **Phương pháp 2 (không sử dụng setup.py):** Giải nén tệp lưu trữ vào một thư mục theo sự lựa chọn của bạn. Khi bạn muốn sử dụng Volatility, chỉ cần chạy python /PATH/TO/vol.py. Phương pháp này thường được coi là sạch sẽ hơn vì không có tệp nào bị di chuyển ra ngoài thư mục được chọn của bạn, do đó nó cũng không yêu cầu quyền quản trị viên. Nếu bạn sử dụng phương pháp này, bạn có thể dễ dàng có nhiều phiên bản của Volatility có sẵn cùng một lúc bằng cách giữ chúng trong các thư mục riêng biệt. Để gỡ cài đặt, chỉ cần xóa thư mục.

### Development Branch (Code Repository)

Volatility hiện đang được lưu trữ trên Github. Đây là nơi bạn có thể tìm thấy mã nguồn mới nhất, bao gồm bất kỳ bản vá lỗi nào được xác định sau một phiên bản phát hành và cũng bao gồm bất kỳ tính năng mới quan trọng nào đang được thử nghiệm trước khi chúng đến người dùng chính thức. Do đó, mã này dành cho những người ít quan tâm đến phiên bản ổn định và hơn là quan tâm đến những gì sắp tới.

Mặc định, các tiện ích điều khiển mã nguồn được tích hợp vào các hệ điều hành Mac gần đây và chúng có sẵn thông qua trình quản lý gói của hầu hết các bản phân phối Linux. Ví dụ, bạn có thể nhập lệnh apt-get install git trên Debian/Ubuntu hoặc yum install git-core trên Centos/Red Hat. Đối với Windows, bạn có thể tải xuống msysGit (http://msysgit.github.io) hoặc sử dụng ứng dụng GitHub (https://windows.github.com). Sau khi đã cài đặt các công cụ, bạn có thể sao chép mã nguồn Volatility. Dưới đây là ví dụ về cách sao chép kho mã nguồn trên Linux hoặc Mac:

```
$ git clone https://github.com/volatilityfoundation/volatility.git
Cloning into 'volatility'...
remote: Counting objects: 10202, done.
remote: Compressing objects: 100% (2402/2402), done.
remote: Total 10202 (delta 7756), reused 10182 (delta 7736)
Receiving objects: 100% (10202/10202), 12.11 MiB | 343.00 KiB/s, done.
Resolving deltas: 100% (7756/7756), done.
Checking connectivity... done.
$ python volatility/vol.py --help
Volatility Foundation Volatility Framework 2.4
Usage: Volatility - A memory forensics analysis platform.
Options:
 -h, --help 	list all available options and their default values.
		 Default values may be set in the configuration file
		 (/etc/volatilityrc)
[snip]
After devel
```

Sau khi các nhà phát triển đã gửi các bản vá hoặc thay đổi mã nguồn, bạn có thể đồng bộ bằng cách đơn giản gõ lệnh git pull, thay vì chờ đợi phiên bản mới. Trong trường hợp này, bạn chỉ cần chuyển các tệp đã thay đổi kể từ lần cập nhật trước đó.


>**GHI CHÚ**

>	Nếu vấn đề hoặc hành vi cụ thể vẫn tiếp diễn sau khi cập nhật, có thể do các tệp .pyc (tệp Python đã biên dịch) "cũ" đã lưu lại. Để làm sạch các tệp .pyc, chuyển vào thư mục gốc của Volatility và nếu bạn đang sử dụng Linux hoặc Mac, gõ lệnh sau:

>	$ make clean

>	Nếu bạn đang sử dụng Windows, mở một cửa sổ PowerShell và gõ lệnh sau:

>	PS C:\volatility> Get-ChildItem -path . -Include '*.pyc' -Recurse | Remove-Item

### Dependencies

Như đã đề cập trước đó, nếu bạn đang làm việc với tệp thực thi độc lập của Windows, bạn không cần lo lắng về các yêu cầu phụ thuộc. Trong tất cả các trường hợp khác, bạn có thể cần cài đặt các gói bổ sung tùy thuộc vào các plugin Volatility mà bạn dự định chạy. Đa số các chức năng cốt lõi sẽ hoạt động mà không cần bất kỳ yêu cầu phụ thuộc nào (ngoại trừ trình thông dịch Python tiêu chuẩn). Danh sách sau đây xác định các mô-đun của bên thứ ba mà Volatility có thể sử dụng và các plugin cụ thể sử dụng chúng.

-	**Distorm3:** Một thư viện giải mã mạnh mẽ cho x86 / AMD64 (http://code.google.com/p/distorm). Các plugin Volatility apihooks, callbacks, impscan, volshell, linux_volshell, mac_volshell và linux_check_syscall phụ thuộc vào thư viện này.
-	**Yara:** Một công cụ xác định và phân loại phần mềm độc hại (http://code.google.com/p/yara-project). Các plugin Volatility yarascan, mac_yarascan và linux_yarascan phụ thuộc vào thư viện này.
-	**PyCrypto:** Bộ công cụ Mã hóa Python (https://www.dlitz.net/software/pycrypto). Các plugin Volatility lsadump và hashdump phụ thuộc vào thư viện này.
-	**PIL:** Thư viện ảnh Python (http://www.pythonware.com/products/pil). Plugin chụp ảnh màn hình phụ thuộc vào thư viện này.
-	**OpenPyxl:** Một thư viện Python để đọc và viết các tệp Excel (https://bitbucket.org/ericgazoni/openpyxl/wiki/Home). Plugin timeliner, khi sử dụng chế độ xuất xlsx, phụ thuộc vào plugin này.

Để biết chi tiết về cách cài đặt các yêu cầu phụ thuộc, bạn nên đọc tài liệu do người duy trì dự án cung cấp. Trong hầu hết các trường hợp, bạn chỉ cần chạy python setup.py install hoặc sử dụng trình quản lý gói. Nếu các yêu cầu phụ thuộc thay đổi, bạn luôn có thể tìm danh sách hiện tại trên wiki của Volatility.

## The Framework

Volatility Framework bao gồm một số hệ thống con hoạt động cùng nhau để cung cấp một bộ tính năng mạnh mẽ. Trong vài trang tiếp theo, chúng ta sẽ giới thiệu các thành phần chính một cách súc tích nhưng tổng quát. Mặc dù một số thành phần dành cho các nhà phát triển hơn là người dùng của framework, các thuật ngữ và khái niệm mà bạn học được ở đây sẽ rất hữu ích để hiểu cách các công cụ pháp yên tạo ra hoạt động, và chúng sẽ được đề cập trong toàn bộ phần còn lại của cuốn sách.

### VTypes

Đây là ngôn ngữ định nghĩa và phân tích cấu trúc của Volatility. Nếu bạn nhớ từ Chương 2, hầu hết các hệ điều hành và ứng dụng chạy trên các hệ điều hành đó đều được viết bằng C, với việc sử dụng rất nhiều cấu trúc dữ liệu để tổ chức các biến và thuộc tính liên quan. Vì Volatility được viết bằng Python, bạn cần một cách để biểu diễn các cấu trúc dữ liệu C trong các tệp nguồn Python. VTypes cho phép bạn làm chính điều đó. Bạn có thể định nghĩa các cấu trúc có tên thành viên, vị trí và kiểu dữ liệu khớp với các cấu trúc được sử dụng bởi hệ điều hành bạn đang phân tích, để khi bạn tìm thấy một phiên bản của cấu trúc đó trong bộ nhớ, Volatility biết cách xử lý dữ liệu cơ bản (ví dụ: như một số nguyên, chuỗi hoặc con trỏ). Trong ví dụ sắp tới, giả sử bạn đang làm việc với cấu trúc dữ liệu C như sau:

```C
struct process {
 int pid;
 int parent_pid;
 char name[10];
 char * command_line;
 void * ptv;
};
```

Cấu trúc này có năm thành viên: hai số nguyên, một mảng ký tự, một con trỏ đến một chuỗi, và một con trỏ void (sẽ được giải thích thêm trong phần "Overlays" sắp tới). Cấu trúc tương đương trong ngôn ngữ VType như sau:

```python
'process' : [ 26, {
 'pid' : [ 0, ['int']],
 'parent_pid' : [ 4, ['int']],
 'name' : [ 8, ['array', 10, ['char']]],
 'command_line' : [ 18, ['pointer', ['char']]],
 'ptv' : [ 22, ['pointer', ['void']]],
}]
```

Ở cái nhìn đầu tiên, cú pháp có thể có vẻ phức tạp hơn một chút, nhưng nó thực chất chỉ là một chuỗi các từ điển và danh sách trong Python. Tên của cấu trúc, "process", là khóa từ điển đầu tiên, và sau đó là kích thước tổng cộng của cấu trúc, là 26 byte. Tiếp theo là các thành viên của cấu trúc, cùng với các offset tương ứng từ cơ sở của cấu trúc và kiểu dữ liệu của chúng. Ví dụ, thành viên "name" có offset 8 và là một mảng gồm 10 ký tự. Khi bạn làm quen với cú pháp này và bắt đầu mô hình hóa các cấu trúc phức tạp hơn, bạn sẽ nhận ra ngôn ngữ VType hỗ trợ cũng nhiều kiểu dữ liệu như C cung cấp. Ví dụ, bạn có thể định nghĩa con trỏ, trường bit, các liệt kê và các liên hiệp (union), để kể một số.

Dưới đây là một ví dụ về cấu trúc "_EPROCESS" từ một hệ thống Windows 7 x64. Tổng kích thước của cấu trúc là 0x4d0 byte và bắt đầu bằng thành viên có tên là "Pcb", thực chất là một cấu trúc khác có kiểu "_KPROCESS". Lưu ý rằng ở offset 0x1f8 có ba thành viên khác nhau: "ExceptionPortData", "ExceptionPortValue" và "ExceptionPortState".

Đây là một ví dụ về cách mà một liên hiệp (union) xuất hiện trong ngôn ngữ VType. Như bạn có thể biết, kích thước của một liên hiệp được quy định bởi phần tử lớn nhất mà nó chứa, trong trường hợp này là 8 byte (một số nguyên không dấu 8 byte). Mặc dù "ExceptionPortState" nằm trong liên hiệp này, nó được định nghĩa là một trường bit, bao gồm ba bit ít quan trọng nhất (bắt đầu từ 0 và kết thúc ở bit thứ 3) của giá trị 8 byte.

```python
'_EPROCESS' : [ 0x4d0, {
 'Pcb' : [ 0x0, ['_KPROCESS']],
 'ProcessLock' : [ 0x160, ['_EX_PUSH_LOCK']],
 'CreateTime' : [ 0x168, ['_LARGE_INTEGER']],
 'ExitTime' : [ 0x170, ['_LARGE_INTEGER']],
 'RundownProtect' : [ 0x178, ['_EX_RUNDOWN_REF']],
 'UniqueProcessId' : [ 0x180, ['pointer64', ['void']]],
 'ActiveProcessLinks' : [ 0x188, ['_LIST_ENTRY']],
 'ProcessQuotaUsage' : [ 0x198, ['array', 2, ['unsigned long long']]],
 'ProcessQuotaPeak' : [ 0x1a8, ['array', 2, ['unsigned long long']]],
 'CommitCharge' : [ 0x1b8, ['unsigned long long']],
 'QuotaBlock' : [ 0x1c0, ['pointer64', ['_EPROCESS_QUOTA_BLOCK']]],
 'CpuQuotaBlock' : [ 0x1c8, ['pointer64', ['_PS_CPU_QUOTA_BLOCK']]],
 'PeakVirtualSize' : [ 0x1d0, ['unsigned long long']],
 'VirtualSize' : [ 0x1d8, ['unsigned long long']],
 'SessionProcessLinks' : [ 0x1e0, ['_LIST_ENTRY']],
 'DebugPort' : [ 0x1f0, ['pointer64', ['void']]],
 'ExceptionPortData' : [ 0x1f8, ['pointer64', ['void']]],
 'ExceptionPortValue' : [ 0x1f8, ['unsigned long long']],
 'ExceptionPortState' : [ 0x1f8, ['BitField', dict(start_bit = 0, end_bit = 3,
 	native_type='unsigned long long')]],
 'ObjectTable' : [ 0x200, ['pointer64', ['_HANDLE_TABLE']]],
[snip]
```

### Generating VTypes

Mặc dù việc làm việc với cú pháp VType có thể là một công việc khá đơn giản sau khi bạn đã làm quen, số lượng cấu trúc mà một hệ điều hành hoặc ứng dụng sử dụng làm cho việc tạo chúng bằng tay vô cùng không thực tế. Hơn nữa, các cấu trúc này có thể thay đổi một cách drastical sau mỗi phiên bản mới của hệ điều hành, hoặc thậm chí chỉ cần một bản vá hay cập nhật bảo mật mới. Để giải quyết những khó khăn này, Brendan Dolan-Gavitt (http://www.cc.gatech.edu/grads/b/brendan/) đã thiết kế một phương pháp để tự động tạo ra các VType từ các ký hiệu gỡ lỗi (PDB files) của Microsoft. Đặc biệt, anh ta đã viết một thư viện có tên là "pdbparse" (https://code.google.com/p/pdbparse) có thể chuyển đổi định dạng tập tin nhị phân PDB của Microsoft sang ngôn ngữ VType mở mà Volatility có thể hiểu.

Nhìn chung, bạn có thể tìm thấy các cấu trúc dữ liệu chính mà Volatility cần hỗ trợ cho một phiên bản Microsoft Windows trong các ký hiệu gỡ lỗi của mô-đun NT kernel (ntoskrnl.exe, ntkrnlpa.exe, và vân vân). Tuy nhiên, điều quan trọng cần lưu ý là Microsoft không tiết lộ tất cả các cấu trúc mà hệ điều hành của họ cần - chỉ có những cấu trúc có thể giúp đỡ việc gỡ lỗi được tiết lộ. Điều này không bao gồm hàng nghìn cấu trúc liên quan đến quản lý mật khẩu, cơ chế bảo mật và các tính năng khác của hệ thống mà tốt hơn là để lại không được tiết lộ để tránh những người tấn công sử dụng thông tin một cách xấu xa (ví dụ: để thiết kế các cuộc tấn công). Trong các trường hợp này, việc tạo ra các VType rơi vào vùng lãnh đạo thủ công: các nhà phát triển hoặc nhà nghiên cứu phải phân tích ngược các thành phần của hệ điều hành và tạo các định nghĩa cấu trúc riêng của họ để sử dụng với Volatility.

### Overlays

Overlays cho phép bạn chỉnh sửa hoặc vá lỗi các định nghĩa cấu trúc tự động tạo ra. Điều này là một khía cạnh quan trọng của phân tích bộ nhớ vì mã hệ điều hành thường sử dụng các con trỏ void (void *) nhiều trong cấu trúc của họ. Một con trỏ void là một con trỏ tới dữ liệu có kiểu không xác định hoặc tùy ý tại thời điểm phân bổ. Thật không may, các ký hiệu gỡ lỗi không chứa đủ thông tin để tự động suy ra các kiểu dữ liệu, và bạn có thể cần theo dõi, hoặc giải tham chiếu, các con trỏ này trong quá trình phân tích. Giả sử bạn đã xác định kiểu cho một thành viên cấu trúc cụ thể (thường thông qua phân tích ngược hoặc thử và lỗi), bạn có thể áp dụng một overlay, sẽ ghi đè định nghĩa VType tự động.

Trong phần trước, bạn có một cấu trúc có tên là "process" với thành viên "void * ptv". Nếu bạn biết rằng "ptv" thực sự là một con trỏ tới một cấu trúc "process" khác, bạn có thể tạo một overlay như sau:

```python
'process' : [ None, {
 'ptv' : [ None, ['pointer', ['process']]],
}
```

Lưu ý hai giá trị None, nằm ở các vị trí thông thường để lưu trữ kích thước của cấu trúc và các vị trí độ lệch thành viên. Giá trị None cho biết không có thay đổi nào được thực hiện đối với các phần đó của định nghĩa. Điều duy nhất mà overlay này thay đổi là kiểu của ptv từ void * thành process *. Sau khi áp dụng overlay như vậy, khi bạn truy cập vào ptv trong các plugin của Volatility, framework sẽ biết rằng bạn đang tham chiếu tới một cấu trúc "process".

Ngoài việc cung cấp khả năng làm cho định nghĩa cấu trúc chính xác hơn, overlays cũng hữu ích cho mục đích tiện ích và nhất quán. Ví dụ, Windows lưu trữ nhiều dấu thời gian của nó trong một cấu trúc được gọi là "_LARGE_INTEGER". Cấu trúc này chứa hai số nguyên 32-bit (một phần thấp và một phần cao), được kết hợp để tạo thành giá trị thời gian 64-bit. Giá trị 1325230153, khi dịch ra, có nghĩa là 2011-12-30 07:29:13 UTC+0000. Nhiều plugin của Volatility cần báo cáo dấu thời gian trong định dạng đọc được cho con người như vậy. Do đó, việc thay đổi toàn cục cấu trúc sử dụng _LARGE_INTEGER để lưu trữ giá trị dấu thời gian thành một kiểu đặc biệt có khả năng tự động dịch giá trị là một ý tưởng hợp lý.

### Objects and Classes (Đối tượng và lớp)

